schnommus/stm32l0_scratch/new_code/Src/main.c
    if( HAL_TSC_GroupGetStatus(&htsc, touch_matrix[index].sample_group)
            == TSC_GROUP_COMPLETED) {
        int v = HAL_TSC_GroupGetValue(&htsc, touch_matrix[index].sample_group);
        // Scale from 1 - 100
        v = touch_matrix[index].calibration_no_touch - v;
        int w = touch_matrix[index].calibration_no_touch - touch_matrix[index].calibration_touch;
        v = (100*v) / w;
        if( v > 100 ) v = 100;
        if( v < 1 ) v = 1;
        return v;
    }

    printf("Touch read didn't complete?\n");

    return -1;
}

// Takes an integer from 0 to 512 (should represent 000 to 5.12)
// Returns a value from 1 to 99 (1 corresponds to 0 degrees, 99 corresponds to 90 degrees)
// The output is scaled as that's what the interpolation needs
int fast_dodgy_atan(int x) {
    static const uint8_t atan_lut[512] = {1,1,2,3,4,4,5,6,6,7,8,9,9,10,11,11,12,13,14,14,15,16,16,17,18,18,19,20,20,21,22,22,23,24,24,25,25,26,27,27,28,29,29,30,30,31,32,32,33,33,34,34,35,36,36,37,37,38,38,39,39,40,40,41,41,42,42,43,43,44,44,45,45,46,46,47,47,48,48,49,49,49,50,50,51,51,52,52,52,53,53,54,54,54,55,55,55,56,56,56,57,57,58,58,58,59,59,59,60,60,60,61,61,61,62,62,62,62,63,63,63,64,64,64,64,65,65,65,66,66,66,66,67,67,67,67,68,68,68,68,69,69,69,69,70,70,70,70,70,71,71,71,71,72,72,72,72,72,73,73,73,73,73,74,74,74,74,74,75,75,75,75,75,75,76,76,76,76,76,77,77,77,77,77,77,78,78,78,78,78,78,78,79,79,79,79,79,79,80,80,80,80,80,80,80,80,81,81,81,81,81,81,81,82,82,82,82,82,82,82,82,83,83,83,83,83,83,83,83,83,84,84,84,84,84,84,84,84,84,85,85,85,85,85,85,85,85,85,86,86,86,86,86,86,86,86,86,86,86,87,87,87,87,87,87,87,87,87,87,87,88,88,88,88,88,88,88,88,88,88,88,88,89,89,89,89,89,89,89,89,89,89,89,89,89,90,90,90,90,90,90,90,90,90,90,90,90,90,90,91,91,91,91,91,91,91,91,91,91,91,91,91,91,91,92,92,92,92,92,92,92,92,92,92,92,92,92,92,92,92,92,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,93,94,94,94,94,94,94,94,94,94,94,94,94,94,94,94,94,94,94,94,94,94,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,95,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,96,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,97,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,98,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99};

    if( x > 511 ) x = 511;
    if( x < 0 ) x = 0;

    return atan_lut[x];
}

typedef struct _interpolation_result {
    int position;
    int pressure;
} interpolation_result_t;

// Takes individual pressure values
// Translates into a position (from 0 to 100) and a touch pressure
// (Note the position may not be especially meaningful for low pressures!)
interpolation_result_t interpolate_touch_values_x(int *values) {
    int x_total = 0, y_total = 0;

    // Create a vector sum, such that final vector angle will
    // correspond to the interpolated position

    x_total += values[0]*100;
    // sin(0)=0
    x_total += values[1]*87;
    y_total += values[1]*50;
    x_total += values[2]*50;
    y_total += values[2]*87;
    y_total += values[3]*100;
    // cos(90)=0

    interpolation_result_t result;
    result.position = fast_dodgy_atan((100*y_total)/x_total);

    result.pressure = x_total*x_total + y_total*y_total;

    return result;
}

interpolation_result_t interpolate_touch_values_y(int *values) {
    int x_total = 0, y_total = 0;

    x_total += values[0]*100;
    // sin(0)=0
    x_total += values[1]*71;
    y_total += values[1]*71;
    y_total += values[2]*100;
    // cos(90)=0

    interpolation_result_t result;
    result.position = fast_dodgy_atan((100*y_total)/x_total);
    result.pressure = x_total*x_total + y_total*y_total;

    return result;
}

#define MOUSE_BUTTON_LEFT   (uint8_t)1
#define MOUSE_BUTTON_RIGHT  (uint8_t)(1 << 1)

void issue_hid_mouse_command(int8_t x_move, int8_t y_move, int8_t scroll, uint8_t buttons) {

    /*
     * BUTTONS = bitmask
     *  LSB = LEFT CLICK (LATCHES TO PRESSED)
     *  2nd to LSB = RIGHT CLICK (LATCHES TO PRESSED)
     * x_move is 8-bit 2-s complement relative movement
     * y_move is 8-bit 2-s complement relative movement
     * scroll is 8-bit 2-s complement relative movement
     */

    uint8_t hid_command[] = {
        COMMAND_START,
        5, // Rest of command length
        COMMAND_MOUSE_TYPE,
        (uint8_t) buttons,
        (uint8_t) x_move,
        (uint8_t) y_move,
        (uint8_t) scroll,
    };

    // Assumes total command length of 7
    HAL_UART_Transmit(&huart1, &hid_command, sizeof(hid_command), 100);
}

void bt_send_cmd(char *s) {
    HAL_UART_Transmit(&huart1, s, strlen(s), 100);
    HAL_Delay(500);
}


#define PWROFF_PUSHTIME_MS 1000
#define MODESWITCH_PUSHTIME_MS 100

enum modes {
    MODE_DISPLAY_X = 0,
    MODE_DISPLAY_Y,
    MODE_DISPLAY_PRESSURE,
    // Insert extra modes here
    MODE_N
};

int main(void)
{

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_ADC_Init();
    MX_I2C1_Init();
    MX_TSC_Init();
    MX_USART1_UART_Init();
    MX_TIM2_Init();

    // Latch power on
    HAL_GPIO_WritePin(PWR_LATCH_GPIO_Port, PWR_LATCH_Pin, GPIO_PIN_SET);

    // All LEDs initially off
    set_led_brightness(RED_CHANNEL, 0);
    set_led_brightness(GREEN_CHANNEL, 0);
    set_led_brightness(BLUE_CHANNEL, 0);

    printf("Starting main loop\n");

    // Boot time in systicks
    int tickStart = HAL_GetTick();
    int tickLastNotPressed = tickStart;

    int current_mode = 0;
/*
    printf("**PROGRAMMING RN-42 MODULE**\n");

    HAL_Delay(2000);

    bt_send_cmd("$$$");
    bt_send_cmd("SF,1\r");
    bt_send_cmd("S-,SmartFork\r");
    bt_send_cmd("SN,SmartFork\r");
    bt_send_cmd("SS,Keyboard/Mouse\r");
    bt_send_cmd("SM,4\r");
    bt_send_cmd("S~,6\r");
    bt_send_cmd("SH,003C\r");
    bt_send_cmd("SY,FFF4\r");
    bt_send_cmd("SW,0040\r");
    bt_send_cmd("SI,0012\r");
    bt_send_cmd("SJ,0012\r");
    bt_send_cmd("R,1\r");

    printf("**FINISHED PROGRAMMING RN-42 MODULE**\n");
    */

    int last_x = 0;
    int last_y = 0;

    while (1) {

