schnommus/stm32l0_scratch/new_code/Src/main.c
        int x1 = sample_touch_at(0, SAMPLE_X);
        int x2 = sample_touch_at(1, SAMPLE_X);
        int x3 = sample_touch_at(2, SAMPLE_X);
        int x4 = sample_touch_at(3, SAMPLE_X);

        int y1 = sample_touch_at(0, SAMPLE_Y);
        int y2 = sample_touch_at(1, SAMPLE_Y);
        int y3 = sample_touch_at(2, SAMPLE_Y);

        int values_x[4] = {x1, x2, x3, x4};
        int values_y[3] = {y1, y2, y3};

        interpolation_result_t interp_x = interpolate_touch_values_x(values_x);
        interpolation_result_t interp_y = interpolate_touch_values_y(values_y);

        int pressure_final = (interp_x.pressure + interp_y.pressure)/10000;

        switch(current_mode) {
            case MODE_DISPLAY_X:
                set_led_brightness(RED_CHANNEL, interp_x.position/4);
            break;
            case MODE_DISPLAY_Y:
                set_led_brightness(GREEN_CHANNEL, interp_y.position/4);
            break;
            case MODE_DISPLAY_PRESSURE:
                set_led_brightness(BLUE_CHANNEL, pressure_final/2000);
            break;
        }

        printf("X=%03d Y=%03d P=%05d\n", interp_x.position, interp_y.position, pressure_final);

        int8_t dx = interp_x.position - last_x;
        int8_t dy = interp_y.position - last_y;

        if(pressure_final > 4000) {
            issue_hid_mouse_command( -dy, -dx*3, 0 ,0);
        }

        last_x = interp_x.position;
        last_y = interp_y.position;

        // Turn off logic, if power button is held down for longer than specific time
        if(HAL_GPIO_ReadPin(PWR_BUTTON_GPIO_Port, PWR_BUTTON_Pin)) {
            if(HAL_GetTick() - tickLastNotPressed > PWROFF_PUSHTIME_MS) {
                break;
            }
        } else {
            if(HAL_GetTick() - tickLastNotPressed > MODESWITCH_PUSHTIME_MS) {
                ++current_mode;
                if(current_mode >= MODE_N) {
                    current_mode = 0;
                }
                set_led_brightness(RED_CHANNEL, 0);
                set_led_brightness(GREEN_CHANNEL, 0);
                set_led_brightness(BLUE_CHANNEL, 0);
                HAL_Delay(50);
            }
            tickLastNotPressed = HAL_GetTick();
        }
    }

    set_led_brightness(RED_CHANNEL, 0);
    set_led_brightness(GREEN_CHANNEL, 0);
    set_led_brightness(BLUE_CHANNEL, 0);


    HAL_GPIO_WritePin(PWR_LATCH_GPIO_Port, PWR_LATCH_Pin, GPIO_PIN_RESET);
    // Power is cut here ^
    HAL_Delay(1000);

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;
    RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Configure the main internal regulator output voltage 
    */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState = RCC_MSI_ON;
    RCC_OscInitStruct.MSICalibrationValue = 0;
    RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_5;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
        |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_I2C1;
    PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
    PeriphClkInit.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure the Systick interrupt time 
    */
    HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

    /* SysTick_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* ADC init function */
static void MX_ADC_Init(void)
{

    ADC_ChannelConfTypeDef sConfig;

    /**Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion) 
    */
    hadc.Instance = ADC1;
    hadc.Init.OversamplingMode = DISABLE;
    hadc.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV1;
    hadc.Init.Resolution = ADC_RESOLUTION_12B;
    hadc.Init.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
    hadc.Init.ScanConvMode = ADC_SCAN_DIRECTION_FORWARD;
    hadc.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc.Init.ContinuousConvMode = DISABLE;
    hadc.Init.DiscontinuousConvMode = DISABLE;
    hadc.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc.Init.DMAContinuousRequests = DISABLE;
    hadc.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    hadc.Init.Overrun = ADC_OVR_DATA_PRESERVED;
    hadc.Init.LowPowerAutoWait = DISABLE;
    hadc.Init.LowPowerFrequencyMode = DISABLE;
    hadc.Init.LowPowerAutoPowerOff = DISABLE;
    if (HAL_ADC_Init(&hadc) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure for the selected ADC regular channel to be converted. 
    */
    sConfig.Channel = ADC_CHANNEL_8;
    sConfig.Rank = ADC_RANK_CHANNEL_NUMBER;
    if (HAL_ADC_ConfigChannel(&hadc, &sConfig) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

    /**Configure for the selected ADC regular channel to be converted. 
    */
    sConfig.Channel = ADC_CHANNEL_TEMPSENSOR;
    if (HAL_ADC_ConfigChannel(&hadc, &sConfig) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

